#include "menu.h"
void menu::menu1()
{
	cout << "欢迎使用学生选课系统" << endl;
	cout << "1-----------管理员登录" << endl;
	cout << "2-----------学生登录" << endl;
	cout << "3-----------退出系统" << endl;
}
void menu::menu2()
{
	cout << "  管理员操作界面" << endl;
	cout << "1-----------添加课程" << endl;
	cout << "2-----------修改课程" << endl;
	cout << "3-----------删除课程" << endl;
	cout << "4-----------查看所有课程" << endl;
	cout << "5-----------添加学生用户" << endl;
	cout << "6-----------修改学生用户" << endl;
	cout << "7-----------删除学生用户" << endl;
	cout << "8-----------查看所有学生用户" << endl;
	cout << "9-----------返回上级" << endl;
	cout << "10-----------退出系统" << endl;
}
void menu::menu3()
{
	cout << "    学生操作界面" << endl;
	cout << "1-----------修改密码" << endl;
	cout << "2-----------选课" << endl;
	cout << "3-----------退课" << endl;
	cout << "4-----------查看已选课程" << endl;
	cout << "5-----------查看所有课程" << endl;
	cout << "6-----------返回上级" << endl;
	cout << "7-----------退出系统" << endl;
}